In [2]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [3]:
# load datasets
film_perf = pd.read_csv("film_performance.csv")
customer_perf = pd.read_csv("customer_behavior.csv")
monthly_trends = pd.read_csv("monthly_trends.csv")
store_staff = pd.read_csv("store_staff_performance.csv")
geo_market = pd.read_csv("geographic_market.csv")
inventory_ops = pd.read_csv("inventory_operations.csv")

In [4]:
datasets = {
    "film_perf": film_perf,
    "customer_perf": customer_perf,
    "monthly_trends": monthly_trends,
    "store_staff": store_staff,
    "geo_market": geo_market,
    "inventory_ops": inventory_ops
}

for name, df in datasets.items():
    print(f"\n{name.upper()}")
    display(df.head())
    print(df.info())

FILM_PERF

,film_id,film_title,category,total_revenue,total_rental,average_revenue,last_rental_date
0,730,Ridgemont Submarine,New,110.72,28,3.954286,2006-02-14 15:16:03
1,892,Titanic Boondock,Animation,149.78,22,6.808182,2006-02-14 15:16:03
2,286,Enough Raging,Travel,51.84,16,3.240000,2006-02-14 15:16:03
3,664,Patriot Roman,Action,52.85,15,3.523333,2005-08-22 16:40:21
4,550,Maguire Apache,Family,33.91,9,3.767778,2005-08-22 12:38:20

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 958 entries, 0 to 957
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           958 non-null    int64
 1   film_title        958 non-null    object
 2   category          958 non-null    object
 3   total_revenue     958 non-null    float64
 4   total_rental      958 non-null    int64
 5   average_revenue   958 non-null    float64
 6   last_rental_date  958 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 52.5+ KB
None

CUSTOMER_PERF

,customer_id,full_name,city,country,total_amount_spent,total_rental,first_rental_date,most_recent_rental_date,number_of_rental_months
0,460,Bostic Leon,Florencia,Colombia,97.79,21,2005-06-15 16:12:27,2005-08-23 19:14:07,2
1,595,Gunderson Terrence,Jinzhou,China,110.71,29,2005-06-14 23:47:35,2005-08-23 21:26:35,2
2,120,Ortiz Sylvia,Dos Quebradas,Colombia,134.70,30,2005-06-15 14:49:54,2006-02-14 15:16:03,7
3,536,Churchill Fernando,Tonghae,South Korea,109.77,23,2005-06-16 04:31:57,2005-08-23 20:08:26,2
4,221,Morrison Bessie,Syrakusa,Italy,127.73,27,2005-06-15 14:29:14,2005-08-22 12:53:22,2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer_id              599 non-null    int64
 1   full_name                599 non-null    object
 2   city                     599 non-null    object
 3   country                  599 non-null    object
 4   total_amount_spent       599 non-null    float64
 5   total_rental             599 non-null    int64
 6   first_rental_date        599 non-null    object
 7   most_recent_rental_date  599 non-null    object
 8   number_of_rental_months  599 non-null    int64
dtypes: float64(1), int64(3), object(5)
memory usage: 42.2+ KB
None

MONTHLY_TRENDS

   year  month  total_rental  total_revenue  customer_number  average_revenue
0  2005      6          2015        8349.85              518         4.143846
1  2005      7          6713       28377.87              599         4.227301
2  2005      8          5686       24070.14              599         4.233229
3  2006      2           182         514.18              158         2.825165

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             4 non-null      int64
 1   month            4 non-null      int64
 2   total_rental     4 non-null      int64
 3   total_revenue    4 non-null      float64
 4   customer_number  4 non-null      int64
 5   average_revenue  4 non-null      float64
dtypes: float64(2), int64(4)
memory usage: 324.0 bytes
None

STORE_STAFF

,store_id,full_name,total_rental,total_revenue_collected,number_of_customer,average_rental
0,1,Hillyer Mike,7331,30498.71,599,8745.348520
1,2,Stephens Jon,7265,30813.33,599,8713.945354

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   store_id                 2 non-null      int64
 1   full_name                2 non-null      object
 2   total_rental             2 non-null      int64
 3   total_revenue_collected  2 non-null      float64
 4   number_of_customer       2 non-null      int64
 5   average_rental           2 non-null      float64
dtypes: float64(2), int64(3), object(1)
memory usage: 228.0+ bytes
None

GEO_MARKET

,city,country,total_rental,total_revenue,unique_customer,most_popular_category
0,A Corua (La Corua),Spain,28,106.72,1,Comedy
1,Abha,Saudi Arabia,23,86.77,1,Sci-Fi
2,Abu Dhabi,United Arab Emirates,29,99.71,1,Action
3,Acua,Mexico,23,100.77,1,Family
4,Adana,Turkey,19,74.81,1,Action

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 597 entries, 0 to 596
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   city                   597 non-null    object
 1   country                597 non-null    object
 2   total_rental           597 non-null    int64
 3   total_revenue          597 non-null    float64
 4   unique_customer        597 non-null    int64
 5   most_popular_category  597 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 28.1+ KB
None

INVENTORY_OPS

,film_id,film_title,category,inventory_count,total_rental,total_revenue,customer_count,last_rental_date,average_rental_duration
0,1,Academy Dinosaur,Documentary,7,21,33.79,21,2005-08-23 01:01:01,4 days 23:39:48
1,2,Ace Goldfinger,Horror,3,7,52.93,7,2006-02-14 15:16:03,5 days 15:25:30
2,3,Adaptation Holes,Documentary,4,11,34.89,11,2005-08-23 13:54:39,3 days 14:38:27.272727
3,4,Affair Prejudice,Horror,7,21,83.79,20,2006-02-14 15:16:03,4 days 16:00:03
4,5,African Egg,Family,3,11,47.89,11,2006-02-14 15:16:03,6 days 26:19:42

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 958 entries, 0 to 957
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   film_id                  958 non-null    int64
 1   film_title               958 non-null    object
 2   category                 958 non-null    object
 3   inventory_count          958 non-null    int64
 4   total_rental             958 non-null    int64
 5   total_revenue            958 non-null    float64
 6   customer_count           958 non-null    int64
 7   last_rental_date         958 non-null    object
 8   average_rental_duration  958 non-null    object
dtypes: float64(1), int64(4), object(4)
memory usage: 67.5+ KB
None

In [5]:
# converting date columns to datetime
date_cols = [
    "last_rental_date", "first_rental_date",
    "most_recent_rental_date", "year_month"
]
for col in date_cols:
    for df in datasets.values():
        if col in df.columns:
            df[col] = pd.to_datetime(df[col])

In [6]:
main_df = pd.merge(film_perf , inventory_ops, on=["film_id", "film_title", "category", "total_revenue","last_rental_date", "total_rental"],)
main_df.to_csv("film_and_inventory.csv", index=False)
main_df.head()

,film_id,film_title,category,total_revenue,total_rental,average_revenue,last_rental_date,inventory_count,customer_count,average_rental_duration
0,730,Ridgemont Submarine,New,110.72,28,3.954286,2006-02-14 15:16:03,8,28,5 days 21:05:13.333333
1,892,Titanic Boondock,Animation,149.78,22,6.808182,2006-02-14 15:16:03,7,21,4 days 19:28:03
2,286,Enough Raging,Travel,51.84,16,3.240000,2006-02-14 15:16:03,5,16,5 days 22:03:32
3,664,Patriot Roman,Action,52.85,15,3.523333,2005-08-22 16:40:21,5,15,5 days 16:45:12
4,550,Maguire Apache,Family,33.91,9,3.767778,2005-08-22 12:38:20,3,9,5 days 12:31:40

In [7]:
monthly_trends.head()

   year  month  total_rental  total_revenue  customer_number  average_revenue
0  2005      6          2015        8349.85              518         4.143846
1  2005      7          6713       28377.87              599         4.227301
2  2005      8          5686       24070.14              599         4.233229
3  2006      2           182         514.18              158         2.825165